V1/Data/ambient/240-2-wrk2-42ppr.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 7.905ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 8.084ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.957ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.977ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.988ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 8.064ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 22.674ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 23.299ms, rate sampling interval: 53ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.30ms    6.74ms  30.67ms   76.64%
    Req/Sec    10.16     46.79   490.00     95.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.88ms
 75.000%   15.35ms
 90.000%   23.47ms
 99.000%   26.91ms
 99.900%   28.80ms
 99.990%   30.09ms
 99.999%   30.69ms
100.000%   30.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.163     0.000000            1         1.00
       6.271     0.100000         2314         1.11
       6.719     0.200000         4626         1.25
       7.091     0.300000         6928         1.43
       7.467     0.400000         9237         1.67
       7.875     0.500000        11546         2.00
       8.115     0.550000        12692         2.22
       8.415     0.600000        13856         2.50
       8.807     0.650000        14991         2.86
       9.479     0.700000        16143         3.33
      15.351     0.750000        17292         4.00
      18.799     0.775000        17872         4.44
      20.127     0.800000        18449         5.00
      21.183     0.825000        19026         5.71
      22.047     0.850000        19598         6.67
      22.767     0.875000        20178         8.00
      23.119     0.887500        20471         8.89
      23.471     0.900000        20758        10.00
      23.855     0.912500        21051        11.43
      24.191     0.925000        21329        13.33
      24.575     0.937500        21619        16.00
      24.767     0.943750        21765        17.78
      24.943     0.950000        21906        20.00
      25.215     0.956250        22056        22.86
      25.455     0.962500        22201        26.67
      25.759     0.968750        22340        32.00
      25.887     0.971875        22411        35.56
      25.999     0.975000        22483        40.00
      26.159     0.978125        22553        45.71
      26.335     0.981250        22629        53.33
      26.527     0.984375        22698        64.00
      26.623     0.985938        22739        71.11
      26.703     0.987500        22768        80.00
      26.831     0.989062        22804        91.43
      26.975     0.990625        22844       106.67
      27.119     0.992188        22877       128.00
      27.199     0.992969        22896       142.22
      27.263     0.993750        22913       160.00
      27.375     0.994531        22931       182.86
      27.471     0.995313        22948       213.33
      27.599     0.996094        22967       256.00
      27.711     0.996484        22977       284.44
      27.823     0.996875        22985       320.00
      27.887     0.997266        22993       365.71
      27.983     0.997656        23002       426.67
      28.127     0.998047        23011       512.00
      28.287     0.998242        23016       568.89
      28.383     0.998437        23021       640.00
      28.543     0.998633        23025       731.43
      28.687     0.998828        23029       853.33
      28.815     0.999023        23034      1024.00
      28.911     0.999121        23036      1137.78
      28.959     0.999219        23038      1280.00
      29.135     0.999316        23041      1462.86
      29.279     0.999414        23043      1706.67
      29.391     0.999512        23046      2048.00
      29.391     0.999561        23046      2275.56
      29.407     0.999609        23047      2560.00
      29.551     0.999658        23049      2925.71
      29.615     0.999707        23050      3413.33
      30.031     0.999756        23051      4096.00
      30.031     0.999780        23051      4551.11
      30.063     0.999805        23052      5120.00
      30.079     0.999829        23053      5851.43
      30.079     0.999854        23053      6826.67
      30.095     0.999878        23054      8192.00
      30.095     0.999890        23054      9102.22
      30.095     0.999902        23054     10240.00
      30.111     0.999915        23055     11702.86
      30.111     0.999927        23055     13653.33
      30.111     0.999939        23055     16384.00
      30.111     0.999945        23055     18204.44
      30.111     0.999951        23055     20480.00
      30.687     0.999957        23056     23405.71
      30.687     1.000000        23056          inf
#[Mean    =       11.299, StdDeviation   =        6.742]
#[Max     =       30.672, Total count    =        23056]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24006 requests in 5.00m, 11.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 6000
Requests/sec:     79.98
Transfer/sec:     39.91KB