V1/Data/ambient/240-2-wrk2-zwmj2.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 9.207ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.437ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.483ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.235ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.133ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.398ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.385ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 15.066ms, rate sampling interval: 34ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.59ms    2.48ms  21.44ms   75.01%
    Req/Sec    10.11     48.42   757.00     95.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.96ms
 75.000%   10.56ms
 90.000%   13.45ms
 99.000%   17.06ms
 99.900%   19.66ms
 99.990%   20.94ms
 99.999%   21.45ms
100.000%   21.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.715     0.000000            1         1.00
       7.115     0.100000         2305         1.11
       7.647     0.200000         4607         1.25
       8.095     0.300000         6927         1.43
       8.511     0.400000         9232         1.67
       8.959     0.500000        11539         2.00
       9.207     0.550000        12699         2.22
       9.471     0.600000        13834         2.50
       9.775     0.650000        14978         2.86
      10.119     0.700000        16129         3.33
      10.559     0.750000        17275         4.00
      10.831     0.775000        17858         4.44
      11.167     0.800000        18431         5.00
      11.599     0.825000        19008         5.71
      12.095     0.850000        19584         6.67
      12.735     0.875000        20155         8.00
      13.095     0.887500        20445         8.89
      13.455     0.900000        20731        10.00
      13.807     0.912500        21023        11.43
      14.191     0.925000        21312        13.33
      14.575     0.937500        21594        16.00
      14.767     0.943750        21742        17.78
      14.991     0.950000        21883        20.00
      15.183     0.956250        22026        22.86
      15.407     0.962500        22170        26.67
      15.687     0.968750        22314        32.00
      15.823     0.971875        22391        35.56
      15.999     0.975000        22459        40.00
      16.175     0.978125        22532        45.71
      16.343     0.981250        22603        53.33
      16.575     0.984375        22679        64.00
      16.687     0.985938        22712        71.11
      16.831     0.987500        22746        80.00
      16.959     0.989062        22785        91.43
      17.119     0.990625        22821       106.67
      17.263     0.992188        22855       128.00
      17.375     0.992969        22872       142.22
      17.487     0.993750        22894       160.00
      17.583     0.994531        22908       182.86
      17.807     0.995313        22926       213.33
      17.999     0.996094        22946       256.00
      18.047     0.996484        22953       284.44
      18.239     0.996875        22962       320.00
      18.399     0.997266        22971       365.71
      18.511     0.997656        22980       426.67
      19.023     0.998047        22989       512.00
      19.151     0.998242        22993       568.89
      19.263     0.998437        23000       640.00
      19.407     0.998633        23002       731.43
      19.615     0.998828        23007       853.33
      19.727     0.999023        23011      1024.00
      19.919     0.999121        23013      1137.78
      20.159     0.999219        23016      1280.00
      20.335     0.999316        23018      1462.86
      20.399     0.999414        23020      1706.67
      20.511     0.999512        23022      2048.00
      20.559     0.999561        23023      2275.56
      20.607     0.999609        23025      2560.00
      20.623     0.999658        23028      2925.71
      20.623     0.999707        23028      3413.33
      20.623     0.999756        23028      4096.00
      20.623     0.999780        23028      4551.11
      20.767     0.999805        23029      5120.00
      20.879     0.999829        23030      5851.43
      20.879     0.999854        23030      6826.67
      20.943     0.999878        23031      8192.00
      20.943     0.999890        23031      9102.22
      20.943     0.999902        23031     10240.00
      20.991     0.999915        23032     11702.86
      20.991     0.999927        23032     13653.33
      20.991     0.999939        23032     16384.00
      20.991     0.999945        23032     18204.44
      20.991     0.999951        23032     20480.00
      21.455     0.999957        23033     23405.71
      21.455     1.000000        23033          inf
#[Mean    =        9.587, StdDeviation   =        2.480]
#[Max     =       21.440, Total count    =        23033]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24007 requests in 5.00m, 11.69MB read
  Socket errors: connect 0, read 0, write 0, timeout 6000
Requests/sec:     79.99
Transfer/sec:     39.90KB